levietduc/CPS_WSAN/nrf52Tutorial/ble_aggregator/main.c
BLE_DB_DISCOVERY_ARRAY_DEF(m_db_disc, NRF_SDH_BLE_CENTRAL_LINK_COUNT);  /**< Database discovery module instances. */

APP_TIMER_DEF(m_adv_led_blink_timer_id);
APP_TIMER_DEF(m_scan_led_blink_timer_id);
APP_TIMER_DEF(m_post_message_delay_timer_id);

//vinh
APP_TIMER_DEF(m_adv_timer_id);    //timer for changing advertising packet
APP_TIMER_DEF(m_hist_refresh_timer_id);    //timer for delete an ID in history buffer 
APP_TIMER_DEF(m_add_edata_adv_buff_timer_id);    //timer for add average enviroment data to broadcast buffer 

//static volatile bool m_service_discovery_in_process = false;
static char  m_target_clusterhead_name[20]=DEVICE_NAME;


static uint16_t   m_service_discovery_conn_handle = BLE_CONN_HANDLE_INVALID;
static uint16_t   m_coded_phy_conn_handle[NRF_SDH_BLE_TOTAL_LINK_COUNT];

static uint16_t   m_per_con_handle       = BLE_CONN_HANDLE_INVALID;
static ble_uuid_t m_adv_uuids[]          =                              /**< Universally unique service identifier. */
{
    {BLE_UUID_AGG_CFG_SERVICE_SERVICE, AGG_CFG_SERVICE_UUID_TYPE}
};

typedef enum {DEVTYPE_NONE, DEVTYPE_BLINKY, DEVTYPE_THINGY} device_type_t;

//device_type_t    m_device_type_being_connected_to = DEVTYPE_NONE;
char             m_device_name_being_connected_to[30];
connected_device_info_t m_device_being_connected_info = {DEVTYPE_NONE, m_device_name_being_connected_to, 0};

static ret_code_t led_status_send_by_mask(uint8_t button_state, uint8_t r, uint8_t g, uint8_t b, uint32_t mask);
static ret_code_t led_status_on_off_send_by_mask(bool on, uint32_t mask);
static ret_code_t post_connect_message(uint8_t conn_handle);
static void       advertising_start(void);


//vinh
/*@brief: check the destination of incoming broadcast msg is to current node 
@input: data to check
byte[1] of data->p_data is the destination 
@output: true if byte[1] match CLUSTER_ID
*/
bool vf_check_destination(uint8_array_t *data);
static void vf_start_broadcast_data(void);
static void vf_start_broadcast_data2(void);
static void vf_stop_broadcast_data(void);

void relay_adv_data2(void);
void vf_relay_adv_data3(void*);
//void vf_adv_thingy_connected(ble_evt_t *p_gap_evt) ;
/*  
@brief: add a packet to buffer for advertising
@input: data 
@output: error=1  if buffer is full*/
uint8_t vf_add_packet_to_buffer(uint8_array_t *data);
uint8_t vf_add_packet_to_buffer2(uint8_array_t *data);
uint8_t vf_add_packet_to_buffer3(uint8_array_t *data);

void vf_delete_block_buffer3(bool cond);

uint16_t vf_add_buff_adv_hist3(uint32_t ids);
uint16_t vf_find_id_buff_adv_hist3(uint32_t id);
void vf_delete_buff_adv_hist3(uint16_t pos);
/*  
@brief: check the destination of original incoming broadcast msg is from current node
@input: data to check
byte[0] of data->p_data is the source 
@output: true if byte[0] match CLUSTER_ID*/
bool vf_check_source(uint8_array_t *data);
void vf_process_adv_command(uint8_array_t *data);
void vf_process_adv_command3(uint8_array_t *br_data);

void relay_adv_data(void);
void vf_relay_adv_data(void*);
//check position of packet in buffer array
//by comparing the 1st 3 bytes:
//  1st: destination id of broadcast
//  2nd: source id of broadcast
//  3rd: packet id
//return position if packet is found (all 3 bytes matched)
//or 0xFFFF if no match packet in buffer

static uint16_t vf_validate_relay_packet(uint8_array_t *checkdata);
static uint16_t vf_validate_relay_packet2(uint8_array_t *checkdata);
static uint16_t vf_validate_relay_packet3(uint8_array_t *checkdata);
/*
@modify relay data by increasing TTL, byte[2] of input
*/
static void vf_modify_relay_data(uint8_array_t *checkdata);

static void vf_tes_c_evt_handler(ble_tes_c_t * p_tes_c, ble_tes_c_evt_t * p_tes_c_evt);
//vinh
//add for userdata
#define MAX_USERDATA_BUFFER MAX_USERDATA_BUFFER_BLOCK*MAX_USERDATA_BUFFER_BLOCKSIZE
static uint8_t garr_userdata[MAX_USERDATA_BUFFER];
uint8_array_t g_userdata={
  .size=0,.p_data=garr_userdata};
uint16_t g_userdata_lastpos=0;
uint16_t g_userdata_firstpos=0;
uint16_t g_userdata_currpos=0;
uint8_t g_packetID=0;
bool g_is_sink=false;

typedef struct struct_adv_history_buff_type
{
  uint32_t id;
  uint16_t  TTL;

}adv_history_buff_t;

#define MAX_HIST_ADV_BUFF_SIZE 128
//#define MAX_HIST_ADV_BUFF_SIZE 8
adv_history_buff_t g_buff_adv_hist[MAX_HIST_ADV_BUFF_SIZE];
uint8_t g_buff_adv_hist_size=0;
uint8_t g_buff_adv_hist_firstpos=0,g_buff_adv_hist_lastpos=0;

//vinh ver4
 
thingy_edata_t g_thingy_edata[NRF_SDH_BLE_CENTRAL_LINK_COUNT];


typedef struct struct_thingy_data_type
{
  uint8_t local_id;
  uint8_t link_state;
  uint8_t button;
  uint16_t  temperature;
  //uint16_t pressure;
  uint32_t pressure;
  uint16_t humidity;
}thingy_data_t;

void vf_adv_thingy_data(thingy_data_t*);

#define ENABLE_PIN_DEBUGGING 0

#if(ITS_ENABLE_PIN_DEBUGGING == 1)
#define DEBUG_PIN_SET(_pin) nrf_gpio_pin_set(DBG_PIN_ ## _pin)
#define DEBUG_PIN_CLR(_pin) nrf_gpio_pin_clear(DBG_PIN_ ## _pin)
#else
#define DEBUG_PIN_SET(_pin) 
#define DEBUG_PIN_CLR(_pin) 
#endif

#define DBG_PIN_0 14
#define DBG_PIN_1 15
#define DBG_PIN_2 16
#define DBG_PIN_3 3
#define DBG_PIN_4 4

static void enable_gpio_debug(void)
{
#if(ENABLE_PIN_DEBUGGING == 1)
    nrf_gpio_cfg_output(DBG_PIN_0);
    nrf_gpio_cfg_output(DBG_PIN_1);
    nrf_gpio_cfg_output(DBG_PIN_2);
    
    // Configure two GPIO's to signal TX and RX activity on the radio, for debugging throughput issues on different phones
    NRF_GPIOTE->CONFIG[0] = GPIOTE_CONFIG_MODE_Task << GPIOTE_CONFIG_MODE_Pos |
                            GPIOTE_CONFIG_POLARITY_Toggle << GPIOTE_CONFIG_POLARITY_Pos | 
                            DBG_PIN_3 << GPIOTE_CONFIG_PSEL_Pos;
    NRF_GPIOTE->CONFIG[1] = GPIOTE_CONFIG_MODE_Task << GPIOTE_CONFIG_MODE_Pos |
                            GPIOTE_CONFIG_POLARITY_Toggle << GPIOTE_CONFIG_POLARITY_Pos | 
                            DBG_PIN_4 << GPIOTE_CONFIG_PSEL_Pos;
    
    NRF_PPI->CH[0].EEP = (uint32_t)&NRF_RADIO->EVENTS_TXREADY;
    NRF_PPI->CH[0].TEP = (uint32_t)&NRF_GPIOTE->TASKS_SET[0];
    
    NRF_PPI->CH[1].EEP = (uint32_t)&NRF_RADIO->EVENTS_RXREADY;
    NRF_PPI->CH[1].TEP = (uint32_t)&NRF_GPIOTE->TASKS_SET[1];
    
    NRF_PPI->CH[2].EEP = (uint32_t)&NRF_RADIO->EVENTS_DISABLED;
    NRF_PPI->CH[2].TEP = (uint32_t)&NRF_GPIOTE->TASKS_CLR[0];
    NRF_PPI->FORK[2].TEP = (uint32_t)&NRF_GPIOTE->TASKS_CLR[1];
    
    NRF_PPI->CHENSET = 0x07;
#endif
}

