levietduc/CPS_WSAN/nrf52Tutorial/ble_aggregator/main.c
static uint8_t m_scan_buffer_data[BLE_GAP_SCAN_BUFFER_EXTENDED_MIN]; /**< buffer where advertising reports will be stored by the SoftDevice. */

/**@brief Pointer to the buffer where advertising reports will be stored by the SoftDevice. */
static ble_data_t m_scan_buffer =
{
    m_scan_buffer_data,
    BLE_GAP_SCAN_BUFFER_EXTENDED_MIN
};
static bool m_scanning_enabled = true;

/**@brief Scan parameters requested for scanning and connection. */
static ble_gap_scan_params_t m_scan_params =
{
    .active   = 1,
    .interval = SCAN_INTERVAL,
    .window   = SCAN_WINDOW,
    .report_incomplete_evts = 0, 
    .extended = 0,
    .timeout           = SCAN_TIMEOUT,
    .scan_phys         = BLE_GAP_PHY_1MBPS,
    .filter_policy     = BLE_GAP_SCAN_FP_ACCEPT_ALL,
    .channel_mask      = {0,0,0,0,0},
};

/**@brief Connection parameters requested for connection. */
static ble_gap_conn_params_t const m_connection_param =
{
    (uint16_t)MIN_CONNECTION_INTERVAL,
    (uint16_t)MAX_CONNECTION_INTERVAL,
    (uint16_t)SLAVE_LATENCY,
    (uint16_t)SUPERVISION_TIMEOUT
};


void uart_printf(const char *fmt, ...)
{
    char buf[256], *p;
    va_list ap;
    va_start(ap, fmt);
    vsnprintf(buf, sizeof(buf), fmt, ap);
    for (p = buf; *p; ++p)
    app_uart_put(*p);
    va_end(ap);
}


/**@brief Function to handle asserts in the SoftDevice.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num     Line number of the failing ASSERT call.
 * @param[in] p_file_name  File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(0xDEADBEEF, line_num, p_file_name);
}


/**@brief Function for the GAP initialization.
 *
 * @details This function will set up all the necessary GAP (Generic Access Profile) parameters of
 *          the device. It also sets the permissions and appearance.
 */
static void gap_params_init(void)
{
    uint32_t                err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    //vinh
    //err_code = sd_ble_gap_device_name_set(&sec_mode,(const uint8_t *) DEVICE_NAME,strlen(DEVICE_NAME));

    err_code = sd_ble_gap_device_name_set(&sec_mode,(const uint8_t *) m_target_clusterhead_name,strlen(m_target_clusterhead_name));

    APP_ERROR_CHECK(err_code);

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_PERIPHERAL_CON_INT;
    gap_conn_params.max_conn_interval = MAX_PERIPHERAL_CON_INT;
    gap_conn_params.slave_latency     = PERIPHERAL_SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = PERIPHERAL_CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);

    err_code = sd_ble_gap_tx_power_set(BLE_GAP_TX_POWER_ROLE_SCAN_INIT, BLE_CONN_HANDLE_INVALID, APP_DEFAULT_TX_POWER);
    APP_ERROR_CHECK(err_code);
}

enum {APPCMD_ERROR, APPCMD_SET_LED_ALL, APPCMD_SET_LED_ON_OFF_ALL, 
      APPCMD_POST_CONNECT_MESSAGE, APPCMD_DISCONNECT_PERIPHERALS,
      APPCMD_DISCONNECT_CENTRAL};


static volatile uint32_t agg_cmd_received = 0;
static uint8_t           agg_cmd[32];

static void agg_cfg_service_data_handler(ble_agg_cfg_service_evt_t * p_evt)
{
    if (p_evt->type == BLE_AGG_CFG_SERVICE_EVT_RX_DATA)
    {
        //while(agg_cmd_received != 0);
        if(agg_cmd_received == 0)
        {
            agg_cmd_received = p_evt->params.rx_data.p_data[0];
            memcpy(agg_cmd, &p_evt->params.rx_data.p_data[1], p_evt->params.rx_data.length);
        }
        else NRF_LOG_WARNING("AGG CMD OVERFLOW!!\r\n");
    }
}

/**@brief Function for the LEDs initialization.
 *
 * @details Initializes all LEDs used by the application.
 */
static void leds_init(void)
{
    bsp_board_init(BSP_INIT_LEDS);
}


/**
 * @brief Parses advertisement data, providing length and location of the field in case
 *        matching data is found.
 *
 * @param[in]  type       Type of data to be looked for in advertisement data.
 * @param[in]  p_advdata  Advertisement report length and pointer to report.
 * @param[out] p_typedata If data type requested is found in the data report, type data length and
 *                        pointer to data will be populated here.
 *
 * @retval NRF_SUCCESS if the data type is found in the report.
 * @retval NRF_ERROR_NOT_FOUND if the data type could not be found.
 */
static uint32_t adv_report_parse(uint8_t type, uint8_array_t * p_advdata, uint8_array_t * p_typedata)
{
    uint32_t  index = 0;
    uint8_t * p_data;

    p_data = p_advdata->p_data;

    while (index < p_advdata->size)
    {
        uint8_t field_length = p_data[index];
        uint8_t field_type   = p_data[index + 1];

        if (field_type == type)
        {
            p_typedata->p_data = &p_data[index + 2];
            p_typedata->size   = field_length - 1;
            return NRF_SUCCESS;
        }
        index += field_length + 1;
    }
    return NRF_ERROR_NOT_FOUND;
}

static bool m_scan_mode_coded_phy = false;

static void adv_led_blink_callback(void *p)
{
    bsp_board_led_invert(PERIPHERAL_ADV_CON_LED);
}

static void scan_led_blink_callback(void *p)
{
    bsp_board_led_invert(CENTRAL_SCANNING_LED);
}


static void scan_led_state_set(bool adv_enabled, bool coded_phy)
{
    static uint32_t current_state = 0;
    if(current_state != ((adv_enabled ? 0x01 : 0) | (coded_phy ? 0x02 : 0)))
    {
        app_timer_stop(m_scan_led_blink_timer_id);
        bsp_board_led_off(CENTRAL_SCANNING_LED);
        if(adv_enabled)
        {
            app_timer_start(m_scan_led_blink_timer_id, APP_TIMER_TICKS(coded_phy ? 400 : 100), 0);
        }
        current_state = (adv_enabled ? 0x01 : 0) | (coded_phy ? 0x02 : 0);
    }
}


/**@brief Function to start scanning. */
static void scan_start(bool coded_phy)
{
    ret_code_t ret;
#ifndef NRF52840_XXAA
    coded_phy = false;
#endif
    //(void) sd_ble_gap_scan_stop();
    if(m_scanning_enabled)
    {
        NRF_LOG_DEBUG("Scan start: Name - %s, phy - %s", (uint32_t)m_target_periph_name, coded_phy ? "Coded" : "1Mbps");
        m_scan_buffer.len = BLE_GAP_SCAN_BUFFER_EXTENDED_MIN;
        m_scan_params.scan_phys = coded_phy ? BLE_GAP_PHY_CODED : BLE_GAP_PHY_1MBPS;
        m_scan_params.extended = coded_phy ? 1 : 0;
        ret = sd_ble_gap_scan_start(&m_scan_params, &m_scan_buffer);
        if(ret == NRF_ERROR_INVALID_STATE)
        {
            NRF_LOG_INFO("scan start invalid state");
        }
        else APP_ERROR_CHECK(ret);

        scan_led_state_set(true, coded_phy);
        m_scan_mode_coded_phy = coded_phy;
    }
}

static void scan_stop(void)
{
    NRF_LOG_DEBUG("scan_stop()");
    uint32_t err_code = sd_ble_gap_scan_stop();
    if(err_code != NRF_SUCCESS)
    {
        NRF_LOG_ERROR("scan_stop() failed with error code: %x", err_code);
    }  
    scan_led_state_set(false, false);
}


/**@brief Handles events coming from the LED Button central module.
 *
 * @param[in] p_lbs_c     The instance of LBS_C that triggered the event.
 * @param[in] p_lbs_c_evt The LBS_C event.
 */
static void lbs_c_evt_handler(ble_lbs_c_t * p_lbs_c, ble_lbs_c_evt_t * p_lbs_c_evt)
{
    switch (p_lbs_c_evt->evt_type)
    {
        case BLE_LBS_C_EVT_DISCOVERY_COMPLETE:
            {
                ret_code_t err_code;

                NRF_LOG_INFO("LED Button service discovered on conn_handle 0x%x",
                             p_lbs_c_evt->conn_handle);

