levietduc/CPS_WSAN/nrf52Tutorial/ble_aggregator/main.c
                //else if(memcmp(m_target_clusterhead_name, dev_name.p_data, strlen(m_target_clusterhead_name)) == 0) //vinh, m_target_clusterhead_name -> CLUSTERHEAD
 
                /*--------------------------------
                //student: advertising receive--
                ------------------------*/
                else if(memcmp((const uint8_t *) DEVICE_NAME, dev_name.p_data, strlen((const uint8_t *) DEVICE_NAME)) == 0) //vinh, m_target_clusterhead_name -> CLUSTERHEAD
              {//found clusterhead name
                  found_clusterhead_data= true;

                  //vinh
                  uint32_t counter = app_timer_cnt_get();
                  uart_printf("find cluster head @time:%d\n\r", counter);//print to COM port

                  //parse data
                  err_code = adv_report_parse(BLE_GAP_AD_TYPE_MANUFACTURER_SPECIFIC_DATA, &adv_data, &userdata);
                  if((err_code == NRF_SUCCESS)&&(p_gap_evt->params.adv_report.rssi >CLUSTERHEAD_RSSI_CONNECT_LIMIT))
                  {//have user data
                    uart_printf("find userdata, $RSSI=%d \n\r",p_gap_evt->params.adv_report.rssi);
                    str_uart[0]=0;
                    for(i=0;i<userdata.size;i++)
                    {
                     sprintf(str2,"%d ",userdata.p_data[i]);
                     strcat(str_uart,str2);
                    }
                    strcat(str_uart,"\n\r");
                    uart_printf(str_uart);

                      
                    if(vf_check_source(&userdata)==true)
                    {//message return to source, do nothing
                       strcpy(str_uart,"reflect data \n\r");
                       uart_printf(str_uart); //print to COM port
                    }
                    else
                    {//message from another source
                        if(vf_check_destination(&userdata)==true)
                        {//match destination -> process data 
                            strcpy(str_uart,"process data \n\r");
                            uart_printf(str_uart);  //print to COM port
                            vf_process_adv_command3(&userdata); 
                        }
                        else 
                        {//not destination -> message to be relayed
                        //validate message(check for redundant message in buffer)
                          if(vf_validate_relay_packet3(&userdata)==0xFFFF) 
                            err_code=vf_add_packet_to_buffer3(&userdata); //new message, add msg to buffer for advertising
                          else
                            uart_printf("Redundant packet\n\r"); //message has already been in buffer 
                        }
                    }//end message from another source
                  }//end having user data
              }//end found cluster head
            }
            //vinh ver3
            //relay_adv_data2();  //broadcast next packet in buffer
            /*-----------------
            end clusterhead advertising recevier handler
            ---------------------*/

        
            // Look for Thingy UUID
            // Filter on RSSI to avoid connecting to everything in the room
            const uint8_t thingy_service_uuid[] = {0x42, 0x00, 0x74, 0xA9, 0xFF, 0x52, 0x10, 0x9B, 0x33, 0x49, 0x35, 0x9B, 0x00, 0x01, 0x68, 0xEF};
            //vinh 
            //if(p_gap_evt->params.adv_report.rssi > THINGY_RSSI_CONNECT_LIMIT || found_blinky_name)
            if(p_gap_evt->params.adv_report.rssi > THINGY_RSSI_CONNECT_LIMIT && found_blinky_name)
            {
                err_code = adv_report_parse(BLE_GAP_AD_TYPE_128BIT_SERVICE_UUID_MORE_AVAILABLE, &adv_data, &service_uuid);
                if (err_code == NRF_SUCCESS)
                {
                    if (memcmp(service_uuid.p_data, thingy_service_uuid, 16) == 0)
                    {
                        NRF_LOG_INFO(found_blinky_name ? "Named Thingy!!" : "Thingy!!");
                        if(found_name)
                        {
                            memcpy(m_device_name_being_connected_to, 
                                   dev_name.p_data, dev_name.size);
                            m_device_name_being_connected_to[dev_name.size] = 0;
                        }
                        m_device_being_connected_info.dev_type = DEVTYPE_THINGY;
                    }
                }
            }

        


            if ((m_device_being_connected_info.dev_type != DEVTYPE_NONE)&& (found_clusterhead_data==false))
            //vinh, add cluster head to check condition   
            {
                m_device_being_connected_info.phy = m_scan_params.scan_phys;
            
                // Initiate connection.
                err_code = sd_ble_gap_connect(peer_addr, &m_scan_params, &m_connection_param, APP_BLE_CONN_CFG_TAG);
                if (err_code != NRF_SUCCESS)
                {
                    NRF_LOG_ERROR("Connection Request Failed, reason %d", err_code);
                }
            }
        }
    }
    if(m_device_being_connected_info.dev_type == DEVTYPE_NONE)
    {
        // As of SoftDevice version 6.0 scanning must be started manually after each received packet
        err_code = sd_ble_gap_scan_start(NULL, &m_scan_buffer);
        if(err_code == NRF_ERROR_INVALID_STATE)
        {
            NRF_LOG_ERROR("scan_start invalid state!!");
        }
        else APP_ERROR_CHECK(err_code);
    }
    else
    {
        scan_led_state_set(false, false);
    }
}

static uint8_t peer_addr_LR[NRF_SDH_BLE_CENTRAL_LINK_COUNT][6];

/**@brief Function for handling BLE events.
 *
 * @param[in]   p_ble_evt   Bluetooth stack event.
 * @param[in]   p_context   Unused.
 */

 //vinh 0, important function
static void ble_evt_handler(ble_evt_t const * p_ble_evt, void * p_context)
{
    ret_code_t err_code;
    static uint8_t coded_phy_conn_count = 0;

    //vinh ver3
    thingy_data_t thingy_data;

    // For readability.
    ble_gap_evt_t const * p_gap_evt = &p_ble_evt->evt.gap_evt;
    //NRF_LOG_INFO("Evt: %i", p_ble_evt->header.evt_id);
    switch (p_ble_evt->header.evt_id)
    {
        // Upon connection, check which peripheral has connected, initiate DB
        // discovery, update LEDs status and resume scanning if necessary.
        case BLE_GAP_EVT_CONNECTED:
        {
            // Handle central connections
            if(p_gap_evt->params.connected.role == BLE_GAP_ROLE_CENTRAL)
            {
                        NRF_LOG_INFO("Peer addr  %02x%02x%02x%02x%02x%02x",
                        peer_addr_LR[p_gap_evt->conn_handle][0],
                        peer_addr_LR[p_gap_evt->conn_handle][1],
                        peer_addr_LR[p_gap_evt->conn_handle][2],
                        peer_addr_LR[p_gap_evt->conn_handle][3],
                        peer_addr_LR[p_gap_evt->conn_handle][4],
                        peer_addr_LR[p_gap_evt->conn_handle][5]);

                NRF_LOG_INFO("Connection 0x%x established , starting DB discovery.",
                             p_gap_evt->conn_handle);

