levietduc/CPS_WSAN/nrf52Tutorial/ble_aggregator/main.c
                memcpy(&peer_addr_LR[p_gap_evt->conn_handle][0], &p_gap_evt->params.connected.peer_addr.addr[0], 6);

                //APP_ERROR_CHECK_BOOL(p_gap_evt->conn_handle < NRF_SDH_BLE_CENTRAL_LINK_COUNT);

                switch(m_device_being_connected_info.dev_type)
                {
                    case DEVTYPE_BLINKY:
                        err_code = ble_lbs_c_handles_assign(&m_lbs_c[p_gap_evt->conn_handle],
                                                            p_gap_evt->conn_handle, NULL);
                        APP_ERROR_CHECK(err_code);
                        break;
                    
                    case DEVTYPE_THINGY:
                        
                        err_code = ble_thingy_uis_c_handles_assign(&m_thingy_uis_c[p_gap_evt->conn_handle],
                                                                   p_gap_evt->conn_handle, NULL);


                        NRF_LOG_INFO("Connected.");      
                        err_code = ble_tes_c_handles_assign(&m_thingy_tes_c[p_gap_evt->conn_handle], p_gap_evt->conn_handle, NULL);
                        APP_ERROR_CHECK(err_code);


                        //vinh ver2
                        if(g_is_sink==false)
                        {//advertise this new node to sink
                          thingy_data.local_id=p_gap_evt->conn_handle;
                          thingy_data.link_state=AGG_NODE_LINK_CONNECTED;
                          thingy_data.button=0;
                          thingy_data.temperature=0; 
                          thingy_data.pressure=0;
                          thingy_data.humidity=0;
                          vf_adv_thingy_data(&thingy_data);
                        //vf_adv_thingy_data(p_gap_evt,AGG_NODE_LINK_CONNECTED); //advertising to sink new thingy 
                        }

                        APP_ERROR_CHECK(err_code);
                        break;
                    
                    default:
                        break;
                }

                m_service_discovery_conn_handle = p_gap_evt->conn_handle;
                memset(&m_db_disc[p_gap_evt->conn_handle], 0x00, sizeof(ble_db_discovery_t));
                err_code = ble_db_discovery_start(&m_db_disc[p_gap_evt->conn_handle],
                                                  p_gap_evt->conn_handle);
                if (err_code != NRF_ERROR_BUSY)
                {
                    APP_ERROR_CHECK(err_code);
                }
                
                err_code = sd_ble_gap_rssi_start(p_gap_evt->conn_handle, 5, 4);
                APP_ERROR_CHECK(err_code);

                err_code = sd_ble_gap_tx_power_set(BLE_GAP_TX_POWER_ROLE_CONN, p_gap_evt->conn_handle, APP_DEFAULT_TX_POWER);
                APP_ERROR_CHECK(err_code);

                // Notify the aggregator service
                app_aggregator_on_central_connect(p_gap_evt, &m_device_being_connected_info);
                
                // Update LEDs status, and check if we should be looking for more
                if (ble_conn_state_central_conn_count() == NRF_SDH_BLE_CENTRAL_LINK_COUNT)
                {
                    bsp_board_led_off(CENTRAL_SCANNING_LED);
                }
                else
                {
                    // Resume scanning.
                    //bsp_board_led_on(CENTRAL_SCANNING_LED);
                    //scan_start();
                }
                
                m_device_being_connected_info.dev_type = DEVTYPE_NONE;

                // check if it was a coded phy connection
                if(BLE_GAP_PHY_CODED == m_scan_params.scan_phys)
                {
                    coded_phy_conn_count++;
                    m_coded_phy_conn_handle[p_gap_evt->conn_handle] = p_gap_evt->conn_handle;
                    bsp_board_led_on(CODED_PHY_LED);
                }
            }
            // Handle links as a peripheral here
            else
            {//connected to phone

                m_per_con_handle = p_gap_evt->conn_handle;
                NRF_LOG_INFO("Peripheral connection 0x%x established.", m_per_con_handle);    
                //vinh, start timer  to update all thingy connection to smartphone
                app_timer_start(m_post_message_delay_timer_id, APP_TIMER_TICKS(2000), 0);
                
                app_timer_stop(m_adv_led_blink_timer_id);
                
                bsp_board_led_on(PERIPHERAL_ADV_CON_LED);
            }
        } break; // BLE_GAP_EVT_CONNECTED

        // Upon disconnection, reset the connection handle of the peer which disconnected, update
        // the LEDs status and start scanning again.
        case BLE_GAP_EVT_DISCONNECTED:
        {
                NRF_LOG_INFO("Peer addr  %02x%02x%02x%02x%02x%02x",
                        peer_addr_LR[p_gap_evt->conn_handle][0],
                        peer_addr_LR[p_gap_evt->conn_handle][1],
                        peer_addr_LR[p_gap_evt->conn_handle][2],
                        peer_addr_LR[p_gap_evt->conn_handle][3],
                        peer_addr_LR[p_gap_evt->conn_handle][4],
                        peer_addr_LR[p_gap_evt->conn_handle][5]);

            NRF_LOG_INFO("GAP_EVT_DISCONNECT: %i", p_gap_evt->conn_handle);

            // Handle central disconnections
            if(p_gap_evt->conn_handle != m_per_con_handle)
            {//thingy disconnected
                NRF_LOG_INFO("LBS central link 0x%x disconnected (reason: 0x%x)",
                             p_gap_evt->conn_handle,
                             p_gap_evt->params.disconnected.reason);

                if(p_gap_evt->conn_handle == m_service_discovery_conn_handle)
                {
                    m_service_discovery_conn_handle = BLE_CONN_HANDLE_INVALID;
                }
                
                // Notify aggregator service
                app_aggregator_on_central_disconnect(p_gap_evt);

                if(m_coded_phy_conn_handle[p_gap_evt->conn_handle] != BLE_CONN_HANDLE_INVALID)
                {
                    // This is a coded phy link that got disconnected
                    m_coded_phy_conn_handle[p_gap_evt->conn_handle] = BLE_CONN_HANDLE_INVALID;
                    if(--coded_phy_conn_count == 0)
                    {
                        bsp_board_led_off(CODED_PHY_LED);
                    }
                }

                //vinh
                uart_printf("Disconnect in main \n\r");

                //vinh
                if(g_is_sink==false)
                {//advertise this new node to sink
                          thingy_data.local_id=p_gap_evt->conn_handle;
                          thingy_data.link_state=AGG_NODE_LINK_DISCONNECTED;
                          vf_adv_thingy_data(&thingy_data);

                 // vf_adv_thingy_data(p_gap_evt->conn_handle,AGG_NODE_LINK_DISCONNECTED);
                //vf_adv_thingy_data(p_gap_evt,AGG_NODE_LINK_CONNECTED); //advertising to sink new thingy 
                }
                
