levietduc/CPS_WSAN/nrf52Tutorial/ble_aggregator/main.c
static ble_advdata_t sr_data = {0}; 
static uint8_t sr_data_buf[ADV_MAX_LENGTH];
static ble_gap_adv_data_t adv_packet;
static ble_gap_adv_data_t adv_packet2;
static ble_gap_adv_params_t adv_params = {0};
static ble_gap_adv_params_t adv_params2 = {0};
static int org_adv_data_size=0;

static ble_advertising_t  gp_advertising={
.adv_data.adv_data.p_data=m_adv_data_buf,
.adv_data.adv_data.len=ADV_MAX_LENGTH,
.adv_data.scan_rsp_data.p_data=m_sr_data_buf,
.adv_data.scan_rsp_data.len=ADV_MAX_LENGTH
};



void relay_adv_data(void)
{

    ret_code_t err_code;
    uint8_t i;

    uint8_t advlen=org_adv_data_size;
    static uint8_t relay_data[32];
     uint16_t pos=g_userdata_firstpos;
    uint8_t relay_size=g_userdata.p_data[pos++];
    if(g_userdata.size>0)
    {
      while(1)
      {
          pos=g_userdata_firstpos;
          relay_size=g_userdata.p_data[pos++];
          if((relay_size==0)||(g_userdata.size>MAX_USERDATA_BUFFER)\
                    ||(g_userdata_firstpos==g_userdata_lastpos))
          {//reset array
            g_userdata_firstpos=g_userdata_lastpos;
            g_userdata.p_data[g_userdata_firstpos]=0;
            g_userdata.size=0;
            break;
          }
          else
          {
            g_userdata.size-=relay_size;
            relay_data[0]=relay_size+1;
            relay_data[1]=0xff; //type: MANU
           
            if(g_userdata_firstpos+relay_size<MAX_USERDATA_BUFFER)
            {
              memcpy(&relay_data[2],&g_userdata.p_data[pos],relay_size-1);
              g_userdata_firstpos+=relay_size;
            }
            else
            {
              memcpy(&relay_data[2],&g_userdata.p_data[pos],MAX_USERDATA_BUFFER-pos);
              memcpy(&relay_data[2+MAX_USERDATA_BUFFER-pos],&g_userdata.p_data[0],relay_size-(MAX_USERDATA_BUFFER-pos)-1);
              g_userdata_firstpos=relay_size-(MAX_USERDATA_BUFFER-pos)-1;
            }

            if(relay_data[5]<8) 
            {
              //g_userdata.p_data[1]+=1;
              //adv_packet.adv_data.p_data[advlen++]=g_userdata.size+1; //length
              //adv_packet.adv_data.p_data[advlen++]=0xff; //type
              //memcpy(&adv_packet.adv_data.p_data[advlen],g_userdata.p_data,g_userdata.size);
              memcpy(&adv_packet.adv_data.p_data[advlen],relay_data,relay_size+1);
              adv_packet.adv_data.len=org_adv_data_size+relay_size+1;
    


             uart_printf("hello %d hello @%d ",adv_packet.adv_data.len,g_userdata_firstpos );
             for(int i=0;i<adv_packet.adv_data.len;i++)
              {
                uart_printf("%d  ",adv_packet.adv_data.p_data[i] );
              }
              uart_printf("\n\r");
              //nrf_delay_ms(100);

             break;

            }
          }
      }//while
    }

    
}


void vf_delete_block_buffer(void)
{//remove current block to the chain
  uint8_t pos,nextpos,prepos;
  pos=g_userdata_currpos;
            if(g_userdata.size==1)
            {//only 1 block
              g_userdata.p_data[pos*MAX_USERDATA_BUFFER_BLOCKSIZE]=0x00;
              g_userdata_firstpos=g_userdata_currpos=g_userdata_lastpos=0;
              g_userdata.size--;
            }
            else
            {
              if(pos==g_userdata_firstpos)
              {//current block is the first block
                 nextpos=g_userdata.p_data[pos*MAX_USERDATA_BUFFER_BLOCKSIZE+1];                 
                 g_userdata.p_data[nextpos*MAX_USERDATA_BUFFER_BLOCKSIZE+2]=0x00;
                 g_userdata_currpos=nextpos;
              }
              else if (pos==g_userdata_lastpos)
              {//current block is the last block
                prepos=g_userdata.p_data[pos*MAX_USERDATA_BUFFER_BLOCKSIZE+2];
                 g_userdata.p_data[prepos*MAX_USERDATA_BUFFER_BLOCKSIZE+1]=0x00;
                g_userdata_currpos=g_userdata_firstpos;
              }
              else{
                 nextpos=g_userdata.p_data[pos*MAX_USERDATA_BUFFER_BLOCKSIZE+1];
                 prepos=g_userdata.p_data[pos*MAX_USERDATA_BUFFER_BLOCKSIZE+2];
                 g_userdata.p_data[nextpos*MAX_USERDATA_BUFFER_BLOCKSIZE+2]=prepos;
                 g_userdata.p_data[prepos*MAX_USERDATA_BUFFER_BLOCKSIZE+1]=nextpos;
                 g_userdata_currpos=nextpos;
              }
              g_userdata.size--;
            }
}


/*---------------------
@Brief: remove a block from advertising buffer chain
input: @ref cond:
                    true: remove block ids (0x00AABBCC, AA:<source id>, BB<dest id>, CC<packet id)) will be added to hist buff
                    false: not added
       @ref g_userdata_currpos: block to be deleted in advertising buffer (g_userdata)
ouput:
update:
  g_userdata_currpos: point to next position in buffer
  g_userdata.size: number of used block in buffer
*/

void vf_delete_block_buffer3(bool cond)
{//remove current block to the chain
  uint16_t pos,nextpos,prepos,pos1;
  size_t i;
  uint32_t ids;

  //save current id
  pos1=g_userdata_currpos;
  pos=g_userdata_currpos*MAX_USERDATA_BUFFER_BLOCKSIZE;
  ids=((uint32_t)g_userdata.p_data[pos+5]<<16)+((uint32_t)g_userdata.p_data[pos+6]<<8)+(uint32_t)g_userdata.p_data[pos+7];

  if(g_userdata.size==0)
  {//no available block in buffer
    return;
  }
  else if(g_userdata.size==1)
  {//only 1 block, then reset all pointer to initial state
    g_userdata.p_data[pos]=0x00;
    g_userdata.p_data[pos+1]=g_userdata.p_data[pos+2]=0xFF;//NULL
    g_userdata_firstpos=g_userdata_currpos=g_userdata_lastpos=0;
    g_userdata.size=0;
   
  }
  else
  {
    if(pos1==g_userdata_firstpos)
    {//current block is the first block
       nextpos=g_userdata.p_data[pos+1];
       g_userdata.p_data[pos]=0x00;//mark deleted block as free block
       g_userdata.p_data[pos+1]=g_userdata.p_data[pos+2]=0xFF;//NULL

       g_userdata.p_data[nextpos*MAX_USERDATA_BUFFER_BLOCKSIZE+2]= 0xFF; //NULL
       g_userdata_firstpos=nextpos;
       //vinh ver4
       //if(g_userdata_currpos==pos1)
       //{
          g_userdata_currpos=g_userdata_firstpos;
       //}

