levietduc/CPS_WSAN/nrf52Tutorial/ble_aggregator/main.c
    }
    else if (pos1==g_userdata_lastpos)
    {//current block is the last block
      prepos=g_userdata.p_data[pos+2];
       g_userdata.p_data[pos]=0x00; //mark as free block
       g_userdata.p_data[pos+1]=g_userdata.p_data[pos+2]=0xFF;//NULL

       g_userdata.p_data[prepos*MAX_USERDATA_BUFFER_BLOCKSIZE+1]= 0xFF; //NULL
       g_userdata_lastpos=prepos;
       //vinh ver4
       //if(g_userdata_currpos==pos1)
       //{
          g_userdata_currpos=g_userdata_firstpos;
       //}
    }
    else{
       nextpos=g_userdata.p_data[pos+1];
       prepos=g_userdata.p_data[pos+2];
       g_userdata.p_data[pos]=0x00; //mark as free block
       g_userdata.p_data[pos+1]=g_userdata.p_data[pos+2]=0xFF;//NULL

       g_userdata.p_data[nextpos*MAX_USERDATA_BUFFER_BLOCKSIZE+2]=prepos;
       g_userdata.p_data[prepos*MAX_USERDATA_BUFFER_BLOCKSIZE+1]=nextpos;
       //vinh ver4if(g_userdata_currpos==pos1)
       //{
          g_userdata_currpos=nextpos;
       //}

    }
    g_userdata.size--;



  }
    uart_printf("delete block %d, new curr pos:%d, new size: %d \n\r",pos1,g_userdata_currpos,g_userdata.size);
 
  if(cond==true)
  {// add ids to history buffer
      vf_add_buff_adv_hist3(ids);
  }
}





/*---------------------
@Brief: advertising a packet in buffer by pasting it to user data field of adv struct
g_userdata_currpos: packet to be sent
g_userdata_firstpos: first packet block in buffer
g_userdata_lastpos: last packet block in buffer
g_userdata.size: number of used block in buffer
*/

void relay_adv_data2(void)
{

    ret_code_t err_code;
    uint8_t i,j=0;

    uint8_t advlen=org_adv_data_size;
    static uint8_t relay_data[32];
     uint16_t pos=g_userdata_firstpos;
    uint8_t relay_size;

    while(g_userdata.size>0) //check nubmer of used block
    {
          pos=g_userdata_currpos;
          if(g_userdata.p_data[pos*MAX_USERDATA_BUFFER_BLOCKSIZE+4]==0)
          {//size of data =0 ->delete block
            vf_delete_block_buffer();
          }
          else if(g_userdata.p_data[pos*MAX_USERDATA_BUFFER_BLOCKSIZE+4+4]>=4) //max TTL=4
          {//TTL expired ->delete block
            vf_delete_block_buffer();
          }
          else
          {
            if(g_userdata_currpos==g_userdata_lastpos) //reach lastpos -> first pos 
                g_userdata_currpos=g_userdata_firstpos;
            else
              g_userdata_currpos=g_userdata.p_data[pos*MAX_USERDATA_BUFFER_BLOCKSIZE+1];

            relay_size= g_userdata.p_data[pos*MAX_USERDATA_BUFFER_BLOCKSIZE+4];
            g_userdata.p_data[pos*MAX_USERDATA_BUFFER_BLOCKSIZE+4+4]++; //increase TTL

            relay_data[0]=relay_size;
            relay_data[1]=0xff; //type: MANUFACTURER  
            memcpy(&relay_data[2],&g_userdata.p_data[pos*MAX_USERDATA_BUFFER_BLOCKSIZE+5],relay_size);
            memcpy(&adv_packet.adv_data.p_data[advlen],relay_data,relay_size+1);
            adv_packet.adv_data.len=org_adv_data_size+relay_size+1;

             uart_printf("adv relay data *%d (len)%d @%d",j,adv_packet.adv_data.len,pos );
              j++;
             for(int i=0;i<adv_packet.adv_data.len;i++)
              {
                uart_printf("%d  ",adv_packet.adv_data.p_data[i] );
              }
              uart_printf("\n\r"); 
            break;
          }

    }//while
   
}


/*---------------------
@Brief: advertising a packet in buffer by pasting it to user data field of adv struct
g_userdata_currpos: packet to be sent
g_userdata_firstpos: first packet block in buffer
g_userdata_lastpos: last packet block in buffer
g_userdata.size: number of used block in buffer
*/

void vf_relay_adv_data3(void* p_indata)
{

    ret_code_t err_code;
    uint8_t i,j=0;

    uint8_t advlen=org_adv_data_size;
    static uint8_t relay_data[32];
    uint8_t relay_size;
    size_t pos;
//TODO: size=0 -> stop broadcast

 
    while(g_userdata.size>0) //check nubmer of used block
    {
          if(g_userdata.p_data[g_userdata_currpos*MAX_USERDATA_BUFFER_BLOCKSIZE+4]==0)
          {//size of broadcast data =0 (invalid block) ->delete block, not add to history buffer
            vf_delete_block_buffer3(false);
          }
          else
          {
          //vinh ver4
            pos=g_userdata_currpos;   //get position of data block to be transfered 
            relay_size= g_userdata.p_data[pos*MAX_USERDATA_BUFFER_BLOCKSIZE+4];
            relay_data[0]=relay_size;
            relay_data[1]=0xff; //type: MANUFACTURER  
            memcpy(&relay_data[2],&g_userdata.p_data[pos*MAX_USERDATA_BUFFER_BLOCKSIZE+5],relay_size-1);
            relay_data[5]++; //increase hop counts

            memcpy(&adv_packet.adv_data.p_data[advlen],relay_data,relay_size+1); //copy data to broadcast
            adv_packet.adv_data.len=org_adv_data_size+relay_size+1;

            uart_printf("adv relay data (len)%d @%d, data: ",adv_packet.adv_data.len,pos );
            j++;
            for(int i=0;i<adv_packet.adv_data.len;i++)
            {
                uart_printf("%d  ",adv_packet.adv_data.p_data[i] );
            }
            uart_printf("\n\r");

            if(--g_userdata.p_data[pos*MAX_USERDATA_BUFFER_BLOCKSIZE+3]==0)
            { // advertised more than 2 times, then move this block to history buffer
                vf_delete_block_buffer3(true);
                uart_printf("buffer state: new currpos=%d, data:",g_userdata_currpos);
                for(i=0;i<MAX_USERDATA_BUFFER_BLOCK;i++)
                {
                  uart_printf("%d ",g_userdata.p_data[i*MAX_USERDATA_BUFFER_BLOCKSIZE]);
                }
                uart_printf("\n\r");
            }
            else
            {
              //vinh ver4
              if(g_userdata_currpos==g_userdata_lastpos) //reach lastpos -> first pos 
                g_userdata_currpos=g_userdata_firstpos;
              else
                g_userdata_currpos=g_userdata.p_data[g_userdata_currpos*MAX_USERDATA_BUFFER_BLOCKSIZE+1];
              uart_printf("buffer state: new currpos=%d \n\r",g_userdata_currpos);
            }

            break;
          }

        if(g_userdata.size==0) vf_stop_broadcast_data();

    }//while
   
