levietduc/CPS_WSAN/nrf52Tutorial/ble_aggregator/main.c
}

/*
@brief: modify relay data by increasing TTL, byte[3] of input
*/
static void vf_modify_relay_data(uint8_array_t *checkdata)
{
  checkdata->p_data[3]++;
}

/*
@brief: validate relay data, looking up in the buffer to find an element match with new data:
1. source addr (byte 0), destination addr(byte 1), packet id(byte2) 
2. if (1.) match, check time to live (byte 3) and update the new to old if the new is higher
 
3.  if (1.) not match, return 0xFFFF -> new packet
*/
static uint16_t vf_validate_relay_packet(uint8_array_t *checkdata)
{

  uint8_t src_id=0;
  uint8_array_t userdata;
  uint8_t cmpdata[4];
  uint8_t i,size;
  size_t temp_pos=g_userdata_firstpos;
  size_t pos=g_userdata_firstpos;
  while(pos!=g_userdata_lastpos)
  {
      temp_pos=pos+1;
      for(i=0;i<4;i++)
      {
        if(temp_pos>=MAX_USERDATA_BUFFER)
        {
          temp_pos=0;
        }
        cmpdata[i]=garr_userdata[temp_pos++];
      }
      if(memcmp(checkdata->p_data,cmpdata,3)==0)
      {//matched
        if(checkdata->p_data[3]>cmpdata[3])
        {//update TTL if new is higher than old
          garr_userdata[temp_pos-1]=checkdata->p_data[3];
        }

        return pos;
      }
      else
      {//unmatched, check next packet in buffer

        size=g_userdata.p_data[pos];
        if(size+pos<=MAX_USERDATA_BUFFER)
        {
          pos+=size;
        }
        else
        {
          pos=0+size-(MAX_USERDATA_BUFFER-pos);
        }
      }
  }
  return 0xFFFF;
}


/*
@brief: validate relay data, looking up in the buffer to find an element match with new data:
1. source id (byte 0), destination id(byte 1), packet id(byte2) 
2. if (1.) match, check time to live (byte 3) and update the new to old if the new is higher
 return the position of match item
3.  if (1.) not match, return 0xFFFF -> new packet
*/
static uint16_t vf_validate_relay_packet2(uint8_array_t *checkdata)
{

  uint8_t src_id=0;
  uint8_array_t userdata;
  uint8_t cmpdata[4];
  uint8_t i,size;
  size_t temp_pos=g_userdata_firstpos;
  size_t pos=g_userdata_firstpos;

  if(g_userdata.size==0)
    return 0xFFFF;
  else if(g_userdata.size==1)
  {
      temp_pos=pos*MAX_USERDATA_BUFFER_BLOCKSIZE+5;    
      for(i=0;i<4;i++)
      {
        cmpdata[i]=g_userdata.p_data[temp_pos++];
      }
      if(memcmp(checkdata->p_data,cmpdata,3)==0)
      {
     /*check TTL
        if(checkdata->p_data[3]>cmpdata[3])
        {//update TTL if new is higher than old
          g_userdata.p_data[temp_pos-1]=checkdata->p_data[3];
        }*/

        return pos;
      }
      else
      {
        return 0xFFFF;
      }

  }
  else
  {
    while(pos!=g_userdata_lastpos)
   {
      temp_pos=pos*MAX_USERDATA_BUFFER_BLOCKSIZE+5;    
      for(i=0;i<4;i++)
      {
        cmpdata[i]=g_userdata.p_data[temp_pos++];
      }
      if(memcmp(checkdata->p_data,cmpdata,3)==0)
      {
      /*check TTL
        if(checkdata->p_data[3]>cmpdata[3])
        {//update TTL if new is higher than old
          g_userdata.p_data[temp_pos-1]=checkdata->p_data[3];
        }*/

        return pos;
      }
      else
      {//unmatched, check next packet in buffer
        pos=g_userdata.p_data[pos*MAX_USERDATA_BUFFER_BLOCKSIZE+1];
      }
    }
  }
  return 0xFFFF;
}



/*--------------------
@brief: modify input data to preparing send back to the source
*/
void vf_process_adv_command(uint8_array_t *data)
{//send to phone
  //if(g_is_sink==true) vinh doing


//vinh doing
    vf_app_adv_data_send_to_phone(data);
}


/*-----------------------------------------------
@brief: validate incomming data, check whether this message was recevice before.
@input: *checkdata:  source addr (byte 0), destination addr(byte 1), packet id(byte2)
   -> merge into 32 bits var ids= 0x00AABBCC, with AA is source id, BB is destination id, CC is packet id
@operation:
  compare ids with:
    - history buffer which contains ids of old messages
        which was either removed from advertising buffer(g_userdata) or processed.
    - if no matched item in history buffer, compare with current advertising buffer(g_userdata)

@return
   if matched found, return the position of the packet
      in history buffer (=0x8000+pos) or advertising buffer (pos)
    else return 0xFFFF -> new packet
*/
static uint16_t vf_validate_relay_packet3(uint8_array_t *checkdata)
{
  uint8_t *cmpdata_pos;
  uint16_t i;
  uint32_t ids=0,cmp_data;
  size_t temp_pos;
  size_t pos=g_userdata_firstpos;

  ids=((uint32_t)checkdata->p_data[0]<<16)+((uint32_t)checkdata->p_data[1]<<8)+(uint32_t)(checkdata->p_data[2]);

  //check history buffer
  if (vf_find_id_buff_adv_hist3(ids)!=0xFFFF)
  {
    uart_printf("find in history buffer: 0x%x \n\r", i);
    return i+8000; //already in history buffer

  }
  //check current buffer
  if(g_userdata.size==0)
    return 0xFFFF;
  else
  {
    uart_printf("ids in operating buffer: ");
    do
    {
      uart_printf("0x%x ,",i);
      temp_pos=pos*MAX_USERDATA_BUFFER_BLOCKSIZE+5; 
      cmpdata_pos=&g_userdata.p_data[temp_pos];
      cmp_data=((*cmpdata_pos)<<16)+((*(cmpdata_pos+1))<<8)+(*(cmpdata_pos+2));
      if(cmp_data==ids)
      {
        uart_printf("find in operating buffer: 0x%x \n\r", i);
        return pos;
      }
      else
      {
        return 0xFFFF;
      }
      pos=g_userdata.p_data[pos*MAX_USERDATA_BUFFER_BLOCKSIZE+1];
    }
    while (pos!=g_userdata_lastpos);
  }

  return 0xFFFF;
}



/*----------
@brief: add an id value to buffer of adverting history
@input: id value (0x00AABBCC, AA: source id, BB: dest id, CC:packet id)
@ouput: position in the array g_buff_adv_hist,
    0xFFFF if this id has already been in the buffer
----------------------*/
uint16_t vf_add_buff_adv_hist3(uint32_t ids)
{
  uint16_t i;

    //check current id has already been in history buffer?
    if((i=vf_find_id_buff_adv_hist3(ids))!=0xFFFF) return 0xFFFF; //yes -> quit

    g_buff_adv_hist[g_buff_adv_hist_lastpos].id=ids;
    g_buff_adv_hist[g_buff_adv_hist_lastpos].TTL=10; //timeout 10 sec
    if(g_buff_adv_hist_size!=MAX_HIST_ADV_BUFF_SIZE)
    {
      if(++g_buff_adv_hist_lastpos==MAX_HIST_ADV_BUFF_SIZE)
          g_buff_adv_hist_lastpos=0;
    }
    else
    {
      if(++g_buff_adv_hist_lastpos==MAX_HIST_ADV_BUFF_SIZE)
          g_buff_adv_hist_lastpos=0;
      g_buff_adv_hist_firstpos=g_buff_adv_hist_lastpos;
    }

    if(g_buff_adv_hist_size<MAX_HIST_ADV_BUFF_SIZE) g_buff_adv_hist_size++;
      

    uart_printf("add to history 0x%x, lastpos:%d, fisrtpos:%d, size:%d \n\r", \
                ids,g_buff_adv_hist_lastpos,g_buff_adv_hist_firstpos,g_buff_adv_hist_size);
  return g_buff_adv_hist_size;
}

/*----------
@brief: delete an element in buffer of advertising history
@input: position
*/
void vf_delete_buff_adv_hist3(uint16_t pos)
{
  uint16_t i,size;

    if(g_buff_adv_hist_size==0)   return;
    g_buff_adv_hist_size--;
    if(++g_buff_adv_hist_firstpos==MAX_HIST_ADV_BUFF_SIZE)
      g_buff_adv_hist_firstpos=0;
  return ;
}

/*----------
@brief: search for position of id value (0x00AABBCC, AA: source id, BB: dest id, CC:packet id)
 in buffer advertising history
@input: id value
@ouput: position in the array g_buff_adv_hist, 0xFFFF if no match position
*/
uint16_t vf_find_id_buff_adv_hist3(uint32_t id)
{
  uint16_t i;

    if(g_buff_adv_hist_size==0) return 0xFFFF;
    if(g_buff_adv_hist_firstpos<g_buff_adv_hist_lastpos)
    {
        for(i=g_buff_adv_hist_firstpos;i<g_buff_adv_hist_lastpos;i++)
        {
          if(id==g_buff_adv_hist[i].id)
          {
            return i ;
          }
        }
    }
    else
    {
        for(i=g_buff_adv_hist_firstpos;i<MAX_HIST_ADV_BUFF_SIZE;i++)
        {
          if(id==g_buff_adv_hist[i].id)
          {
            return i ;
          }
        }
        for(i=0;i<g_buff_adv_hist_lastpos;i++)
        {
          if(id==g_buff_adv_hist[i].id)
          {
            return i ;
          }
        }
    }

  return 0xFFFF;
}

//vinh ver4
void vf_add_edata_adv_buff_callback(void * p_context)
{

