levietduc/CPS_WSAN/nrf52Tutorial/ble_aggregator/main.c
  int i;
  thingy_data_t thingy_data;
  int16_t temperature;
  int32_t pressure;
  int16_t humidity;
  uint8_t button_state;
  uint8_t arr_data[32];
  uint8_array_t idata;
  for(i=0;i<NRF_SDH_BLE_CENTRAL_LINK_COUNT;i++)
  {

    if(m_thingy_tes_c[i].conn_handle!=BLE_CONN_HANDLE_INVALID)
    {
      temperature=vf_ble_tes_average_temperature(&g_thingy_edata[i]);
      pressure=vf_ble_tes_average_pressure(&g_thingy_edata[i]);
      humidity=vf_ble_tes_average_humidity(&g_thingy_edata[i]);
      button_state=g_thingy_edata[i].button;
      if(g_is_sink==false)
      {
         //send button state to sink
         thingy_data.local_id=m_thingy_tes_c[i].conn_handle;
         thingy_data.link_state=AGG_NODE_LINK_DATA_UPDATE;
         thingy_data.button=button_state;
         thingy_data.temperature=temperature;
         thingy_data.pressure=pressure;
         thingy_data.humidity=humidity;
         vf_adv_thingy_data(&thingy_data);  //add data to buffer
         uart_printf("Thingy ENV handle:%d, i:%d \n\r", m_thingy_tes_c[i].conn_handle,i);

      }
      else
      {

// //       idata.p_data=arr_data;
// //       //send local thingy data to phone
//        idata.p_data[0]=CLUSTER_ID; //cluster source id
//        idata.p_data[1]=SINK_ID; //cluster destination id
//        idata.p_data[2]=g_packetID++; //packet No
//        idata.p_data[3]=0; //hop counts  
//        idata.p_data[4]=AGG_NODE_LINK_DATA_UPDATE; //link state 
//        idata.p_data[5]=i; //local id
//        idata.p_data[6]=(uint8_t)(temperature>>8);//temp1
//        idata.p_data[7]=(uint8_t)(temperature&0x00FF);//temp1
//        idata.p_data[8]=(uint8_t)(pressure>>8);//pressure1
//        idata.p_data[9]=(uint8_t)(pressure&0x00FF);//pressure2         
//        idata.p_data[10]=(uint8_t)(humidity>>8);//hummi 1
//        idata.p_data[11]=(uint8_t)(humidity&0x00FF);//hummi 2
//        idata.p_data[12]=0x0;//button state
//        idata.size=13;
//        vf_app_adv_data_send_to_phone(&idata);
//        
        //vinhstop
      }
    }
  }
  

}

/*----------
@brief: search for position of id value (0x00AABBCC, AA: source id, BB: dest id, CC:packet id)
 in buffer advertising history
@input: id value
@ouput: position in the array g_buff_adv_hist, 0xFFFF if no match position
*/
void vf_refresh_history_buff_callback(void * p_context)
{
  uint16_t i,j,count=0;
  uint8_t str1[64]="delete hist buff:",str2[10];

    if(g_buff_adv_hist_size==0) return;


    if(g_buff_adv_hist_firstpos<g_buff_adv_hist_lastpos)
    {
        for(i=g_buff_adv_hist_firstpos;i<g_buff_adv_hist_lastpos;i++)
        {
          if(g_buff_adv_hist[i].TTL>0)
          {
            g_buff_adv_hist[i].TTL--; ;
          }
        }
    }
    else
    {
        for(i=g_buff_adv_hist_firstpos;i<MAX_HIST_ADV_BUFF_SIZE;i++)
        {
          if(g_buff_adv_hist[i].TTL>0)
          {
            g_buff_adv_hist[i].TTL--; ;
          }
        }
        for(i=0;i<g_buff_adv_hist_lastpos;i++)
        {
          if(g_buff_adv_hist[i].TTL>0)
          {
            g_buff_adv_hist[i].TTL--; ;
          }
        }
    }

    if(g_buff_adv_hist_firstpos<g_buff_adv_hist_lastpos)
    {
      for(i=g_buff_adv_hist_firstpos;i<g_buff_adv_hist_lastpos;i++)
      {
          if( g_buff_adv_hist[i].TTL==0) break;

      }
      if(i!=g_buff_adv_hist_lastpos)
      {
        count=1;

        sprintf(str2,"%d ",i);
        strcat(str1,str2);

        for(j=i+1;j<g_buff_adv_hist_lastpos;j++)
        {
            if(g_buff_adv_hist[j].TTL!=0)
            {
              g_buff_adv_hist[i++]=g_buff_adv_hist[j];

              sprintf(str2,"%d ",j);
              strcat(str1,str2);

            }
            else
            {
              count++;
            }

        }
        g_buff_adv_hist_lastpos=i;
        g_buff_adv_hist_size-=count;

        strcat(str1,"\n\r");
        uart_printf(str1);
      }

    }
    else
    {
      for(i=g_buff_adv_hist_firstpos;i<MAX_HIST_ADV_BUFF_SIZE;i++)
      {
          if( g_buff_adv_hist[i].TTL==0) break;

      }
      if(i!=MAX_HIST_ADV_BUFF_SIZE)
      {
        count=1;

        sprintf(str2,"%d ",i);
        strcat(str1,str2);

        for(j=i+1;j<MAX_HIST_ADV_BUFF_SIZE;j++)
        {
            if(g_buff_adv_hist[j].TTL!=0)
            {
              g_buff_adv_hist[i++]=g_buff_adv_hist[j];
              sprintf(str2,"%d ",j);
              strcat(str1,str2);

            }
            else
            {
              count++;
            }

        }
        for(j=0;j<g_buff_adv_hist_lastpos;j++)
        {
            if(g_buff_adv_hist[j].TTL!=0)
            {
              g_buff_adv_hist[i++]=g_buff_adv_hist[j];
              sprintf(str2,"%d ",j);
              strcat(str1,str2);

            }
            else
            {
              count++;
            }
            if(i>=MAX_HIST_ADV_BUFF_SIZE) i=0;

        }

        g_buff_adv_hist_lastpos=i;
        g_buff_adv_hist_size-=count;

        strcat(str1,"\n\r");
        uart_printf(str1);
      }
      else
      {
          for(i=0;i<g_buff_adv_hist_lastpos;i++)
          {
              if( g_buff_adv_hist[j].TTL==0) break;

          }
          if(i!=g_buff_adv_hist_lastpos)
          {
            count=1;
              sprintf(str2,"%d ",i);
              strcat(str1,str2);
            for(j=i+1;j<g_buff_adv_hist_lastpos;j++)
            {
                if(g_buff_adv_hist[j].TTL!=0)
                {
                  g_buff_adv_hist[i++]=g_buff_adv_hist[j];
                  sprintf(str2,"%d ",j);
                  strcat(str1,str2);
                }
                else
                {
                  count++;
                }

            }
            g_buff_adv_hist_lastpos=i;
            g_buff_adv_hist_size-=count;

            strcat(str1,"\n\r");
            uart_printf(str1);
          }
      }

    }


  


  return;


}

/*--------------------
@brief: process command from the source
    1. compare new data has been processed before by buffer of advertising history
    2. If not, process command, else quit
@input: broadcast data
*/
void vf_process_adv_command3(uint8_array_t *br_data)
{//send to phone
  //if(g_is_sink==true) vinh doing
  uint32_t ids;
  ids=(((uint32_t)br_data->p_data[0])<<16)+(((uint32_t)br_data->p_data[1])<<8)+((uint32_t)br_data->p_data[2]);
  uart_printf("ids:0x%x \n\r", ids);

  if(vf_validate_relay_packet3(br_data)==0xFFFF)
  {//new data
    vf_app_adv_data_send_to_phone(br_data); //process -> send data to phone
    vf_add_buff_adv_hist3(ids); //add this id to history buffer
  }
  else 
    uart_printf("duplicate command \n\r");
}


