levietduc/CPS_WSAN/nrf52Tutorial/ble_aggregator/main.c
/*------------
start advertising dummy data using buffer
---------*/
static void vf_start_broadcast_data(void)
{


    uint8_t buff[32];
    uint8_t i;
    uint8_array_t buffdata;
    ret_code_t err_code;
    uart_printf("add start broadcast data\n\r");
    err_code=sd_ble_gap_adv_stop(m_adv_handle);
    uart_printf("$r1 %d ",err_code);
 /*
   static bool k1=false;   
    if(k1==true)
      err_code=sd_ble_gap_adv_stop(m_adv_handle);
    else
      err_code=sd_ble_gap_adv_stop(m_adv_handle);

    uart_printf("$r1 %d ",err_code);
  nrf_delay_ms(500);
*/



    buff[0]=19; //length
    buff[1]=0xff; //type
    buff[2]=CLUSTER_ID; //source
    buff[3]=SINK_ID; //destination
    buff[4]=0x3; //Packet_no
    buff[5]=0x0; //TTL
    buff[6]=0x1; 
    buff[7]=0x2;
    buff[8]=0x3;
    buff[9]=0x4;   
    buff[10]=5;             
   buff[11]=6;
  buff[12]=7;
  buff[13]=8;
  buff[14]=9;
  buff[15]=10;
  buff[16]=11;
  buff[17]=12;
  buff[18]=13;
  buff[19]=14;
  buffdata.p_data=&buff[2];
  buffdata.size=18;
  vf_add_packet_to_buffer3(&buffdata);
  //memcpy(&adv_packet.adv_data.p_data[org_adv_data_size],buff,20);


  err_code = sd_ble_gap_adv_start(m_adv_handle, APP_BLE_CONN_CFG_TAG);
    //APP_ERROR_CHECK(err_code);
  uart_printf("$r3 %d ",err_code);
}


/*------------
start advertising dummy data directly
---------*/
static void vf_start_broadcast_data2(void)
{

    uint8_t buff[32];
    uint8_t i;
    uint8_array_t buffdata;
    ret_code_t err_code;
    uart_printf("add start broadcast data\n\r");
    err_code=sd_ble_gap_adv_stop(m_adv_handle); //stop advertising
    uart_printf("$err1 %d ",err_code); 
 /*
   static bool k1=false;   
    if(k1==true)
      err_code=sd_ble_gap_adv_stop(m_adv_handle);
    else
      err_code=sd_ble_gap_adv_stop(m_adv_handle);

    uart_printf("$r1 %d ",err_code);
  nrf_delay_ms(500);
*/



    buff[0]=19; //length
    buff[1]=0xff; //type
    buff[2]=CLUSTER_ID; //source
    buff[3]=SINK_ID; //destination
    buff[4]=0x3; //Packet_no
    buff[5]=0x0; //TTL
    buff[6]=0x1; 
    buff[7]=0x2;
    buff[8]=0x3;
    buff[9]=0x4;   
    buff[10]=5;             
   buff[11]=6;
  buff[12]=7;
  buff[13]=8;
  buff[14]=9;
  buff[15]=10;
  buff[16]=11;
  buff[17]=12;
  buff[18]=13;
  buff[19]=14;
  buffdata.p_data=&buff[0];
  buffdata.size=18;
  //vf_add_packet_to_buffer2(&buffdata);
  memcpy(&adv_packet.adv_data.p_data[org_adv_data_size],buff,20);


  err_code = sd_ble_gap_adv_start(m_adv_handle, APP_BLE_CONN_CFG_TAG); //start advertising
    //APP_ERROR_CHECK(err_code);
  uart_printf("$err2 %d ",err_code);
}


static void vf_stop_broadcast_data(void)
{

    uint8_t buff[32];
    uint8_t i;
    ret_code_t err_code;
    uart_printf(" stop broadcast userdata \n\r");

    err_code=sd_ble_gap_adv_stop(m_adv_handle);
    //uart_printf("$r1 %d ",err_code);

    memset(buff,0,32);
    memcpy(&adv_packet.adv_data.p_data[org_adv_data_size],buff,20);   

       err_code = sd_ble_gap_adv_start(m_adv_handle, APP_BLE_CONN_CFG_TAG);
    //APP_ERROR_CHECK(err_code);
    //uart_printf("$r3 %d ",err_code);
}

bool vf_check_source(uint8_array_t *data)
{
  if((data->p_data[0])==CLUSTER_ID) return true;
  else return false;
}

bool vf_check_destination(uint8_array_t *data)
{
  if((data->p_data[1])==CLUSTER_ID) return true;
  else return false;
}


void vf_adv_thingy_data(thingy_data_t *data)
{


  uint8_t data_arr[32],str1[20],i;
  uint8_array_t idata;
//vinh doing

  idata.p_data=data_arr;
  idata.p_data[0]=CLUSTER_ID; //cluster source id
  idata.p_data[1]=SINK_ID; //cluster destination id
  idata.p_data[2]=g_packetID++; //packet No
  idata.p_data[3]=0; //hop counts  
  idata.p_data[4]=data->link_state; //link state 
  idata.p_data[5]=data->local_id; //local id
  switch(data->link_state)
  {
    case AGG_NODE_LINK_CONNECTED:

        idata.p_data[6]=0x12;//temp1
        idata.p_data[7]=0x12;//temp1
        idata.p_data[8]=0x00;//pressure1
        idata.p_data[9]=0x01;//pressure2 
        idata.p_data[10]=0x02;//pressure3
        idata.p_data[11]=0x03;//pressure4                
        idata.p_data[12]=0x00;//hummi 1
        idata.p_data[13]=0x78;//hummi 2
        idata.p_data[14]=0x0;//button state
        idata.size=15;
        break;

    case AGG_NODE_LINK_DISCONNECTED:
        idata.size=6;
        break;

    case AGG_NODE_LINK_DATA_UPDATE:
        idata.p_data[6]=data->temperature>>8;//temp1
        idata.p_data[7]=(uint8_t)(data->temperature&0x00FF);//temp1
        idata.p_data[8]=data->pressure>>24;//pressure1 MSB
        idata.p_data[9]=data->pressure>>16;//pressure2
        idata.p_data[10]=data->pressure>>8;//pressure3
        idata.p_data[11]=(uint8_t)(data->pressure&0x00FF);//pressure4  LSB                   

        idata.p_data[12]=data->humidity>>8;//hummi 1
        idata.p_data[13]=(uint8_t)(data->humidity&0x00FF);//hummi 2
        idata.p_data[14]=data->button;//button state
        idata.size=15;
        break;
  }


  uart_printf(" Add Thingy data to buffer: ");
  for(i=0;i<idata.size;i++)
  {
    sprintf(str1,"%d ",idata.p_data[i]);
    uart_printf(str1);
  }
  uart_printf("\r\n");
  vf_add_packet_to_buffer3(&idata);
  
  //vinh ver3
 // relay_adv_data2();
}


uint8_t vf_add_packet_to_buffer(uint8_array_t *data)
{
  uint8_array_t *userdata=data;
  uint8_t err_code=0;
  size_t trim_pos,i;
  if((g_userdata.size+userdata->size+1)<=MAX_USERDATA_BUFFER)
  {//buffer not overflow
      g_userdata.size+=userdata->size+1;
      g_userdata.p_data[g_userdata_lastpos++]=userdata->size+1;

      if((g_userdata_lastpos+userdata->size)>=MAX_USERDATA_BUFFER)
      {
          memcpy(&g_userdata.p_data[g_userdata_lastpos],userdata->p_data,MAX_USERDATA_BUFFER-g_userdata_lastpos);
          trim_pos=MAX_USERDATA_BUFFER-g_userdata_lastpos;
          g_userdata_lastpos=userdata->size-(MAX_USERDATA_BUFFER-g_userdata_lastpos);
          memcpy(&g_userdata.p_data[0],&userdata->p_data[trim_pos],g_userdata_lastpos);
      }
      else
      {
         memcpy(&g_userdata.p_data[g_userdata_lastpos],userdata->p_data,userdata->size);
         g_userdata_lastpos+=userdata->size;
      }
      uart_printf("add packet to buffer");
      uart_printf("@%d $%d $%d *",g_userdata_lastpos,userdata->size,g_userdata.size);
      if(g_userdata_firstpos+g_userdata.size<MAX_USERDATA_BUFFER)
      {
          for(i=g_userdata_firstpos;i<g_userdata_firstpos+g_userdata.size;i++)
          {
           uart_printf("%d ", g_userdata.p_data[i]);
            //sprintf(str_uart, "%d ",userdata.p_data[i]);
          }
      }
      else
      {
            for(i=g_userdata_firstpos;i<MAX_USERDATA_BUFFER;i++)
            {
             uart_printf("%d ", g_userdata.p_data[i]);
            //sprintf(str_uart, "%d ",userdata.p_data[i]);
            }
            for(i=0;i<g_userdata_lastpos;i++)
            {
             uart_printf("%d ", g_userdata.p_data[i]);
            //sprintf(str_uart, "%d ",userdata.p_data[i]);
            }
      }
      uart_printf("\n\r");
  }//end buffer not full
  else
  {
    uart_printf("Buffer full");
    err_code=1;
  }
  return err_code;
}


