levietduc/CPS_WSAN/nrf52Tutorial/ble_aggregator/main.c
uint8_t vf_add_packet_to_buffer2(uint8_array_t *data)
{
//each block include 32 bytes
//byte 0: block property: 0x0: free, 0xFF: used
//byte 1: pointer to next available block,0xFF is NULL
//byte 2: pointer to previous available block,0xFF is NULL
//byte 4..n:size + data
//g_userdata_lastpos: position of last block in buffer
//g_userdata_firstpos: position of last block in buffer
  uint8_array_t *userdata=data;
  uint8_t err_code=1;
  size_t pos,i;
  if((g_userdata.size)<MAX_USERDATA_BUFFER_BLOCK)
  {//buffer not overflow

      for(i=0;i<MAX_USERDATA_BUFFER_BLOCK;i++)
      {
        if(g_userdata.p_data[i*MAX_USERDATA_BUFFER_BLOCKSIZE]==0) //found free block
        {
          err_code=0;
          break;
        }
      }
      
      if(err_code==0)
      {  
      //found free block
        pos=i;
        if( g_userdata.size==0)
        {
          g_userdata.p_data[pos*32+1]=g_userdata.p_data[pos*32+2]=0xFF; 
          g_userdata_currpos=g_userdata_lastpos=g_userdata_firstpos=pos;
        }
        else
        {
          g_userdata.p_data[g_userdata_lastpos*32+1]=pos; //update previous "next block pointer"
          g_userdata.p_data[pos*32+2]=g_userdata_lastpos; //update current "pre block pointer"
          g_userdata_lastpos=pos; //update last position
        }
        g_userdata.p_data[pos*MAX_USERDATA_BUFFER_BLOCKSIZE]=0xFF;  //mark as used block
        g_userdata.p_data[pos*MAX_USERDATA_BUFFER_BLOCKSIZE+4]=userdata->size+1; //number of data byte in this block, include this byte
        memcpy(&g_userdata.p_data[pos*MAX_USERDATA_BUFFER_BLOCKSIZE+5],userdata->p_data,userdata->size);
        g_userdata.size++; 
      }
  

  }//end buffer not full

  if (err_code==0)
  {
       uart_printf("@%d $%d $%d *",g_userdata.size,g_userdata_lastpos,userdata->size); 
       for(i=0;i<userdata->size+1+4;i++)
       {
          uart_printf("%d ", g_userdata.p_data[g_userdata_lastpos*MAX_USERDATA_BUFFER_BLOCKSIZE+i]);
       }
      uart_printf("\n\r");
  }
  else
  {
    uart_printf("Buffer full");
  }
  return err_code;
}


/*--------------------------------
@brief: add broadcast data to buffer for advertising
@input: user data in *data
@output: return value 0: success, 1: buffer full

data is coupled into buffer at the posiont pointed by g_userdata_lastpos

Structure of a block (32 bytes)
  byte 0: block property: 0x0: free, 0xFF: used
  byte 1: pointer to next available block,0xFF is NULL
  byte 2: pointer to previous available block,0xFF is NULL
  byte 3: number of advertsing times before removing
  byte 4: size (=(size of broadcase data)+1)
  byte 5..n: broadcast data
          broadcast data (br_data)
            byte 0: source id
            byte 1: destination id
            byte 2: packet id
            byte 3: hop counts
            byte 4..18: user data 

//g_userdata_lastpos: position of last block in buffer
//g_userdata_firstpos: position of last block in buffer
//g_userdata_currpos: position of current block which is adverting
//g_userdata : buffer
---------*/

uint8_t vf_add_packet_to_buffer3(uint8_array_t *br_data)
{

  uint8_array_t *userdata=br_data;
  uint8_t err_code=1;
  size_t pos,i;
  if((g_userdata.size)<MAX_USERDATA_BUFFER_BLOCK)
  {//buffer not overflow

      for(i=0;i<MAX_USERDATA_BUFFER_BLOCK;i++)
      {
        if(g_userdata.p_data[i*MAX_USERDATA_BUFFER_BLOCKSIZE]==0) //found free block
        {
          err_code=0;
          break;
        }
      }
      
      if(err_code==0)
      {  
      //found free block
        pos=i;
        if( g_userdata.size==0)
        {
          g_userdata.p_data[pos*MAX_USERDATA_BUFFER_BLOCKSIZE+1]=g_userdata.p_data[pos*MAX_USERDATA_BUFFER_BLOCKSIZE+2]=0xFF; //pointer to next and previous block
          g_userdata_currpos=g_userdata_lastpos=g_userdata_firstpos=pos;
        }
        else
        {
          g_userdata.p_data[g_userdata_lastpos*MAX_USERDATA_BUFFER_BLOCKSIZE+1]=pos; //update previous "next block pointer"
          g_userdata.p_data[pos*MAX_USERDATA_BUFFER_BLOCKSIZE+2]=g_userdata_lastpos; //update current "pre block pointer"
          g_userdata.p_data[pos*MAX_USERDATA_BUFFER_BLOCKSIZE+1]=0xFF; //pointer to next block is NULL
          g_userdata_lastpos=pos; //update last position
        }
        g_userdata.p_data[pos*MAX_USERDATA_BUFFER_BLOCKSIZE]=0xFF;  //mark as used block
        g_userdata.p_data[pos*MAX_USERDATA_BUFFER_BLOCKSIZE+3]=2;  //advertise 2 times before remove this block
        g_userdata.p_data[pos*MAX_USERDATA_BUFFER_BLOCKSIZE+4]=userdata->size+1; //number of data byte in this block, include this byte
        memcpy(&g_userdata.p_data[pos*MAX_USERDATA_BUFFER_BLOCKSIZE+5],userdata->p_data,userdata->size);
        g_userdata.size++;
      } 

  }//end buffer not overflow

  if (err_code==0)
  {
       uart_printf("add data to buffer firstpos:%d, currpos:%d, lastpos:$%d buffsize:$%d *",g_userdata_firstpos,g_userdata_currpos,g_userdata_lastpos,g_userdata.size); 
       for(i=0;i<userdata->size+1+4;i++)
       {
          uart_printf("%d ", g_userdata.p_data[g_userdata_lastpos*MAX_USERDATA_BUFFER_BLOCKSIZE+i]);
       }
      uart_printf("\n\r");
  }
  else
  {
    uart_printf("Buffer full");
  }
  return err_code;
}

/**@brief Handles events coming from the Thingy Environment central module.
 */
static void vf_tes_c_evt_handler(ble_tes_c_t * p_tes_c, ble_tes_c_evt_t * p_tes_c_evt)
{
    uint16_t connection_handle=p_tes_c_evt->conn_handle;
    switch (p_tes_c_evt->evt_type)
    {
        case BLE_TES_C_EVT_DISCOVERY_COMPLETE:
        {
            ret_code_t err_code;

           err_code = ble_tes_c_handles_assign(&m_thingy_tes_c[p_tes_c_evt->conn_handle],
                                               p_tes_c_evt->conn_handle,
                                               &p_tes_c_evt->params.peer_db);
            uart_printf("Thingy Environment service discovered on conn_handle 0x%x.", p_tes_c_evt->conn_handle);

            // Thingy Environment service discovered. Enable notification of sensor data.
            err_code = ble_tes_c_temperature_notif_enable(p_tes_c);
            APP_ERROR_CHECK(err_code);
            err_code = ble_tes_c_pressure_notif_enable(p_tes_c);
            APP_ERROR_CHECK(err_code);
            err_code = ble_tes_c_humidity_notif_enable(p_tes_c);
            APP_ERROR_CHECK(err_code);
            //err_code = ble_tes_c_gas_notif_enable(p_tes_c);
            //APP_ERROR_CHECK(err_code);
            //err_code = ble_tes_c_color_notif_enable(p_tes_c);
            //APP_ERROR_CHECK(err_code);
//            err_code = ble_tes_c_config_notif_enable(p_tes_c);
//            APP_ERROR_CHECK(err_code);
            
        } break; // BLE_TES_C_EVT_DISCOVERY_COMPLETE

