levietduc/CPS_WSAN/nrf52Tutorial/ble_aggregator/main.c
        case BLE_TES_C_EVT_TEMPERATURE_NOTIFICATION:
        {
            ble_tes_temperature_t temperature = p_tes_c_evt->params.value.temperature_data;
            vf_ble_tes_add_sum_temperature(&g_thingy_edata[connection_handle],temperature);         

            uart_printf("Got Thingy @%d temperature: %d,%d, sum:%d \n\r",p_tes_c_evt->conn_handle,\
                    temperature.integer, temperature.decimal,g_thingy_edata[connection_handle].temperature);
        } break; // BLE_TES_C_EVT_TEMPERATURE_NOTIFICATION
        case BLE_TES_C_EVT_PRESSURE_NOTIFICATION:
        {
            ble_tes_pressure_t pressure = p_tes_c_evt->params.value.pressure_data;
            vf_ble_tes_add_sum_pressure(&g_thingy_edata[connection_handle],pressure); 

            uart_printf("Got Thingy @%d pressure: %d,%d \n\r",connection_handle, pressure.integer, pressure.decimal);
        } break; // BLE_TES_C_EVT_PRESSURE_NOTIFICATION
        case BLE_TES_C_EVT_HUMIDITY_NOTIFICATION:
        {
            ble_tes_humidity_t humidity = p_tes_c_evt->params.value.humidity_data;
            vf_ble_tes_add_sum_humidity(&g_thingy_edata[connection_handle],humidity); 

            uart_printf("Got Thingy @%d humidity: %d \n\r",connection_handle,humidity);
        } break; // BLE_TES_C_EVT_HUMIDITY_NOTIFICATION
        case BLE_TES_C_EVT_GAS_NOTIFICATION:
        {
            ble_tes_gas_t gas = p_tes_c_evt->params.value.gas_data;
            uart_printf("Got C02: %d \n\r", gas.eco2_ppm);
            uart_printf("Got organic components: %d \n\r", gas.tvoc_ppb);
        } break; // BLE_TES_C_EVT_GAS_NOTIFICATION
        case BLE_TES_C_EVT_COLOR_NOTIFICATION:
        {
            ble_tes_color_t color = p_tes_c_evt->params.value.color_data;
            uart_printf("Got color. R%d, G%d, B%d, C%d \n\r", color.red, color.green, color.blue, color.clear);
        } break; // BLE_TES_C_EVT_COLOR_NOTIFICATION
        case BLE_TES_C_EVT_CONFIG_NOTIFICATION:
        {
            // No implementation. 
        } break; // BLE_TES_C_EVT_CONFIG_NOTIFICATION

        default:
            // No implementation needed.
            break;
    }
}





/**@brief Function for setting up advertising data. */
static void advertising_data_set(void)
{
    ret_code_t err_code;

    
    adv_data.name_type          = BLE_ADVDATA_FULL_NAME;
    adv_data.flags              = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;
    adv_data.include_appearance = false;


    sr_data.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
    sr_data.uuids_complete.p_uuids = m_adv_uuids;
 
 
    adv_packet.adv_data.p_data = &adv_data_buf[0];
    adv_packet.adv_data.len = ADV_MAX_LENGTH;
    adv_packet.scan_rsp_data.p_data = sr_data_buf;
    adv_packet.scan_rsp_data.len = ADV_MAX_LENGTH;

    


    err_code = ble_advdata_encode(&adv_data, adv_packet.adv_data.p_data, &adv_packet.adv_data.len);
    APP_ERROR_CHECK(err_code);
    
    err_code = ble_advdata_encode(&sr_data, adv_packet.scan_rsp_data.p_data, &adv_packet.scan_rsp_data.len);
    APP_ERROR_CHECK(err_code);

   //vinh
    org_adv_data_size=adv_packet.adv_data.len;
    uart_printf("%d  ",adv_packet.adv_data.len );
    

    //student: initial advertising data
    org_adv_data_size=adv_packet.adv_data.len;  //mark the start position of datafield 


    memset(&adv_packet.adv_data.p_data[org_adv_data_size],0,20);
    adv_packet.adv_data.len=org_adv_data_size+20; //length

    
    //adv_params.properties.connectable = 1;
    //adv_params.properties.scannable = 1;
    //adv_params.properties.legacy_pdu = 1;
    adv_params.properties.type = BLE_GAP_ADV_TYPE_CONNECTABLE_SCANNABLE_UNDIRECTED;
    adv_params.p_peer_addr   = NULL;
    adv_params.filter_policy = BLE_GAP_ADV_FP_ANY;
    adv_params.interval      = PERIPHERAL_ADV_INTERVAL;
    adv_params.duration      = PERIPHERAL_ADV_TIMEOUT_IN_SECONDS * 100;
    adv_params.primary_phy   = BLE_GAP_PHY_1MBPS;
    adv_params.secondary_phy = BLE_GAP_PHY_1MBPS;

    memcpy((void*)&adv_params2,(void*)&adv_params,sizeof(adv_params));

    err_code = sd_ble_gap_adv_set_configure(&m_adv_handle, &adv_packet, &adv_params);
    APP_ERROR_CHECK(err_code);
    
 
}


/**@brief Function for starting advertising. */
static void advertising_start(void)
{
    NRF_LOG_INFO("Starting advertising.");
    
    ret_code_t err_code = sd_ble_gap_adv_start(m_adv_handle, APP_BLE_CONN_CFG_TAG);
    APP_ERROR_CHECK(err_code);
    
    err_code = app_timer_start(m_adv_led_blink_timer_id, APP_TIMER_TICKS(500), 0);
    APP_ERROR_CHECK(err_code);

    //vinh, start advertising timer with 200ms interval to change advertising packet in buffer
    err_code = app_timer_start(m_adv_timer_id, APP_TIMER_TICKS(200), 0);
    APP_ERROR_CHECK(err_code);

    //timer for delete a history id if history buffer
    err_code = app_timer_start(m_hist_refresh_timer_id, APP_TIMER_TICKS(1000), 0);
    //APP_ERROR_CHECK(err_code);

}


/**@brief Function for writing to the LED characteristic of all connected clients.
 *
 * @details Based on if the button is pressed or released, this function writes a high or low
 *          LED status to the server.
 *
 * @param[in] button_action The button action (press/release).
 *            Determines if the LEDs of the servers will be ON or OFF.
 *
 * @return If successful NRF_SUCCESS is returned. Otherwise, the error code from @ref ble_lbs_led_status_send.
 */
static ret_code_t led_status_send_to_all(uint8_t button_action)
{
    ret_code_t err_code;

    for (uint32_t i = 0; i< NRF_SDH_BLE_CENTRAL_LINK_COUNT; i++)
    {
        err_code = ble_lbs_led_status_send(&m_lbs_c[i], button_action);

        if(err_code != NRF_SUCCESS)
        {
            err_code = ble_thingy_uis_led_set_on_off(&m_thingy_uis_c[i], button_action);
            //err_code = ble_thingy_uis_led_set_constant(&m_thingy_uis_c[i], button_action ? 255 : 0, button_action ? 255 : 0, button_action ? 255 : 0);
            if (err_code != NRF_SUCCESS &&
                err_code != BLE_ERROR_INVALID_CONN_HANDLE &&
                err_code != NRF_ERROR_INVALID_STATE)
            {
                return err_code;
            }
        }
    }
    return NRF_SUCCESS;
}
 
 
static ret_code_t led_status_send_by_mask(uint8_t button_action, uint8_t r, uint8_t g, uint8_t b, uint32_t mask)
{
    ret_code_t err_code;
    uint8_t colors[3] = {r, g, b};
    
    app_aggregator_on_led_color_set(r, g, b, mask);

