levietduc/CPS_WSAN/nrf52Tutorial/ble_aggregator/main.c
    for (uint32_t i = 0; i < NRF_SDH_BLE_CENTRAL_LINK_COUNT; i++)
    {
        if((mask & (1 << i)) != 0)
        {
            // First, try to access the devices as a Blinky device
            err_code = ble_lbs_led_color_send(&m_lbs_c[i], colors);
            if(err_code != NRF_SUCCESS)
            {
                // If the blinky call fails, assume this is a Thingy device
                err_code = ble_thingy_uis_led_set_constant(&m_thingy_uis_c[i], button_action ? r : 0, button_action ? g : 0, button_action ? b : 0);
                if (err_code != NRF_SUCCESS &&
                    err_code != BLE_ERROR_INVALID_CONN_HANDLE &&
                    err_code != NRF_ERROR_INVALID_STATE)
                {
                    return err_code;
                }
            }
        }
    }
    return NRF_SUCCESS;    
}

ret_code_t led_status_on_off_send_by_mask(bool on, uint32_t mask)
{
    ret_code_t err_code;

    app_aggregator_on_led_update(on, mask);
    
    for (uint32_t i = 0; i < NRF_SDH_BLE_CENTRAL_LINK_COUNT; i++)
    {
        if((mask & (1 << i)) != 0)
        {
            err_code = ble_lbs_led_status_send(&m_lbs_c[i], on);
            if(err_code != NRF_SUCCESS)
            {
                err_code = ble_thingy_uis_led_set_on_off(&m_thingy_uis_c[i], on);
                if (err_code != NRF_SUCCESS &&
                    err_code != BLE_ERROR_INVALID_CONN_HANDLE &&
                    err_code != NRF_ERROR_INVALID_STATE)
                {
                    return err_code;
                }
            }
        }
    }
    return NRF_SUCCESS;      
}

ret_code_t post_connect_message(uint8_t conn_handle)
{
    ret_code_t err_code = NRF_SUCCESS;
    for(int i = 0; i < NRF_SDH_BLE_CENTRAL_LINK_COUNT; i++)
    {
        if(m_lbs_c[i].conn_handle == conn_handle)
        {
            err_code = ble_thingy_uis_led_set_on_off(&m_thingy_uis_c[i], true);
        }
        
        if(m_thingy_uis_c[i].conn_handle == conn_handle)
        {
            err_code = ble_thingy_uis_led_set_constant(&m_thingy_uis_c[i], 255, 255, 255);  
        }
    }
    return err_code;
}

ret_code_t disconnect_all_peripherals()
{
    ret_code_t err_code;
    for(int i = 0; i < NRF_SDH_BLE_CENTRAL_LINK_COUNT; i++)
    {
        if(m_lbs_c[i].conn_handle != BLE_CONN_HANDLE_INVALID)
        {
            err_code = sd_ble_gap_disconnect(m_lbs_c[i].conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            if(err_code != NRF_SUCCESS)
            {
                //return err_code;
            }
        }
        
        else if(m_thingy_uis_c[i].conn_handle != BLE_CONN_HANDLE_INVALID)
        {
            err_code = sd_ble_gap_disconnect(m_thingy_uis_c[i].conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            if(err_code != NRF_SUCCESS)
            {
                //return err_code;
            }
        }
    }    
    return NRF_SUCCESS;
}

/**@brief Function for handling events from the button handler module.
 *
 * @param[in] pin_no        The pin that the event applies to.
 * @param[in] button_action The button action (press/release).
 */


static void button_event_handler(uint8_t pin_no, uint8_t button_action)
{
    ret_code_t err_code;
    uint8_array_t userdata;
    static bool k=true;
    switch (pin_no)
    {
        case CENTRAL_DISCONNECT_BUTTON:

/*
            if(m_per_con_handle != BLE_CONN_HANDLE_INVALID)
            {
                sd_ble_gap_disconnect(m_per_con_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            }
            break;
  */
        //vinh
        if(k==true)
        {
                    vf_stop_broadcast_data();
            k=false;
        }
        else
          k=true;
                    break;

        case SCAN_START_STOP_BUTTON:
            if(button_action == APP_BUTTON_PUSH)
            {
                m_scanning_enabled = !m_scanning_enabled;
                if(m_scanning_enabled)
                {
                    scan_start(false);
                }
                else
                {
                    scan_stop();
                }
            }
            break;

        case LEDBUTTON_BUTTON:
            err_code = led_status_send_to_all(button_action);
            if (err_code == NRF_SUCCESS)
            {
                NRF_LOG_INFO("LBS write LED state %d", button_action);
            }
            //vinh
          if(k==true)
          {
          vf_start_broadcast_data();
          k=false;
          }
          else
           k=true;

        //vinh
        case TEST_BUTTON:
         

          break;
        default:
            APP_ERROR_HANDLER(pin_no);
            break;
    }
}


/**@brief Function for initializing the button handler module.
 */
static void buttons_init(void)
{
    ret_code_t err_code;

   // The array must be static because a pointer to it will be saved in the button handler module.
    static app_button_cfg_t buttons[] =
    {
        {CENTRAL_DISCONNECT_BUTTON, false, BUTTON_PULL, button_event_handler},
        {SCAN_START_STOP_BUTTON,    false, BUTTON_PULL, button_event_handler},
        {LEDBUTTON_BUTTON,          false, BUTTON_PULL, button_event_handler}
    };

    err_code = app_button_init(buttons, ARRAY_SIZE(buttons), BUTTON_DETECTION_DELAY);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling database discovery events.
 *
 * @details This function is callback function to handle events from the database discovery module.
 *          Depending on the UUIDs that are discovered, this function should forward the events
 *          to their respective services.
 *
 * @param[in] p_event  Pointer to the database discovery event.
 */
static void db_disc_handler(ble_db_discovery_evt_t * p_evt)
{
    NRF_LOG_DEBUG("call to ble_lbs_on_db_disc_evt for instance %d and link 0x%x!",
                  p_evt->conn_handle,
                  p_evt->conn_handle);

    ble_lbs_on_db_disc_evt(&m_lbs_c[p_evt->conn_handle], p_evt);
    ble_thingy_uis_on_db_disc_evt(&m_thingy_uis_c[p_evt->conn_handle], p_evt);
    ble_tes_on_db_disc_evt(&m_thingy_tes_c[p_evt->conn_handle], p_evt);

