levietduc/CPS_WSAN/nrf52Tutorial/ble_aggregator/main.c
            case APPCMD_DISCONNECT_CENTRAL://disconnect to phone event
                sd_ble_gap_disconnect(m_per_con_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
                break;
            
            default:
                break;
        }
        agg_cmd_received = 0;
    }
}





int main(void)
{
    uint32_t err_code;

    //vinh
    //name clusterhead and string to detect blinky group
    char str1[4],s;
    sprintf(str1,"%d",CLUSTER_ID);
 
    strcat(m_target_clusterhead_name,(const char*)str1);
    /*s='A'+CLUSTER_ID-1;
    m_target_blinky_name[0]=m_target_blinky_name[1]=s;
    m_target_blinky_name[2]=0;*/
    g_userdata_currpos=g_userdata_lastpos=g_userdata_firstpos;
    g_userdata.size=0;  
    memset(garr_userdata,0,sizeof(garr_userdata));
    memset(&g_buff_adv_hist,0,sizeof(g_buff_adv_hist));
    g_buff_adv_hist_firstpos=g_buff_adv_hist_lastpos=0;
    g_buff_adv_hist_size=0;

    memset(g_thingy_edata,0,sizeof(g_thingy_edata));

    if(CLUSTER_ID==SINK_ID)
      g_is_sink=true;
    else
      g_is_sink=false;


    log_init();
    timer_init();
    uart_init();
    leds_init();
    buttons_init();
    ble_stack_init();
    gap_params_init();
    gatt_init();
    services_init();
    app_aggregator_init(&m_agg_cfg_service);
    db_discovery_init();
    lbs_c_init();
    thingy_uis_c_init();
    thingy_tes_c_init(); //vinh ver4, thingy enviroment sevice initial
    ble_conn_state_init();
    advertising_data_set();
    conn_params_init();
    
    enable_gpio_debug();

    NRF_LOG_INFO("Multilink example started");
    //uart_printf("Multilink example started. Group name \"%s\"\r\n", m_target_periph_name); //vinh, change group name
    uart_printf("Multilink example started. Device Name \"%s\"\r\n", m_target_clusterhead_name); //vinh, change group name
    uart_printf("Multilink example started. Thingy Group \"%s\"\r\n", m_target_blinky_name); //vinh, change group name

    

    for (int i = 0; i < NRF_SDH_BLE_TOTAL_LINK_COUNT; ++i){
        m_coded_phy_conn_handle[i] = BLE_CONN_HANDLE_INVALID; //vinh, init the handle
    }
    // Start scanning for peripherals and initiate connection to devices which  advertise.
    scan_start(false);
    err_code = app_timer_start(m_add_edata_adv_buff_timer_id, APP_TIMER_TICKS(10000), 0); //timer for perodically updating Thingy data to phone
    APP_ERROR_CHECK(err_code);

    // Start advertising
    advertising_start();
    
    err_code = app_button_enable();
    APP_ERROR_CHECK(err_code);
    
    for (;;)
    {
        if(m_per_con_handle != BLE_CONN_HANDLE_INVALID) //vinh BLE is ongoing
        {
            while(app_aggregator_flush_ble_commands()); //flush all command in buffer
        }

        process_app_commands();

        device_list_print();
        
        while(NRF_LOG_PROCESS());

        power_manage();
    }
}


